import requests
from datetime import datetime
from collections import defaultdict
from config import API_KEY
import locale

try:
    locale.setlocale(locale.LC_TIME, 'en_US.UTF-8')
except locale.Error:
    locale.setlocale(locale.LC_TIME, 'C')

API_KEY = API_KEY


def get_weather_by_city(city):
    url = f'https://api.openweathermap.org/data/2.5/forecast?q={city}&appid={API_KEY}&units=metric&lang=ru'
    response = requests.get(url)
    data = response.json()

    if response.status_code != 200 or 'list' not in data:
        return None  # ошибка

    forecast_by_day = defaultdict(list)

    for item in data['list']:
        date_str = item['dt_txt']
        date = datetime.strptime(date_str, '%Y-%m-%d %H:%M:%S')
        day_name = date.strftime('%A')  # всегда будет на английском
        temp = item['main']['temp']
        forecast_by_day[day_name].append(temp)

    weekdays_order = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
    today = datetime.today().strftime('%A')
    start_index = weekdays_order.index(today)
    ordered_days = weekdays_order[start_index:] + weekdays_order[:start_index]

    result = []
    for day in ordered_days:
        if day in forecast_by_day:
            temps = forecast_by_day[day]
            day_data = {
                'day': day[:3],
                'temp_max': round(max(temps)),
                'temp_min': round(min(temps))
            }
            result.append(day_data)
        if len(result) == 5:
            break
    return result


def generate_recommendations(temp_max, city):
    if temp_max >= 30:
        recommendation = (
            "По можливості уникати перебування на вулиці з 12:00 до 16:00, особливо у прямих сонячних променях. "
            "Носити світлий, вільний одяг з натуральних тканин (бавовна, льон) та головний убір. "
            "Пити багато рідини (найкраще - вода без цукру і кофеїну) - не чекаючи спраги."
            "Уникати інтенсивної фізичної активності та спорту на вулиці. По можливості використовувати вентилятори або кондиціонери. "
            "<br><strong>Особливі рекомендації: </strong> Людям із серцево-судинними захворюваннями, гіпертонією, діабетом, захворюваннями дихальної системи, а також людям похилого віку — особливо важливо уникати перегріву. "
            "Дітям і вагітним жінкам особливо важливо дотримуватися водного режиму і не перебувати під сонцем тривалий час. "
        )
        return recommendation
    elif 20 <= temp_max < 30:
        recommendation = (
            "Сьогодні комфортна тепла погода, що ідеально підходить для прогулянок і занять на свіжому повітрі. "
            "Рекомендується одягнути легкий одяг із натуральних тканин, використовувати сонцезахисні окуляри і при необхідності - крем від сонця. "
            "Не забувайте пити воду протягом дня, особливо якщо ви перебуваєте в русі або займаєтеся фізичною активністю. "
            "Якщо ви проводите тривалий час на сонці, намагайтеся по можливості перебувати в тіні в полуденний годинник (з 12:00 до 15:00).\n"
            "<br><strong>Особливі поради: </strong>"
            "Людям з хронічними шкірними захворюваннями (наприклад, екзема, псоріаз) слід уникати перегріву та використовувати захисні засоби. "
            "Старим людям та дітям рекомендується не забувати про головний убір та підтримку водного балансу. "
            "Людям, які приймають препарати, що підвищують чутливість до сонця, слід уникати тривалого перебування під прямим сонячним промінням."
        )
    elif 10 <= temp_max < 20:
        recommendation = (
            "Сьогодні прохолодна погода. Комфортно для прогулянок та активностей на свіжому повітрі, особливо у денний час. "
            "Вранці та ввечері температура може відчуватися нижче, тому рекомендується одягати легку куртку або светр. "
            "Уникайте переохолодження, особливо якщо дме вітер або підвищена вологість. При тривалому перебуванні на вулиці носіть закрите взуття та шаруватий одяг, щоб легко адаптуватися до змін температури.\n"
            "<br><strong>Особливі поради: </strong>"
            "Людям із захворюваннями дихальної системи (наприклад, астма, бронхіт) рекомендується стежити за рівнем вологості та уникати вогкості. "
            "Старим людям і дітям важливо одягатися тепло, особливо в ранкові та вечірні години. "
            "Якщо у вас чутливі суглоби або схильність до застуд - уникайте тривалого перебування на протягу і переохолодження."
        )
    elif 0 <= temp_max < 10:
        recommendation = (
            "На вулиці холодно. Рекомендується тепло одягатися: використовувати багатошаровий одяг, утеплену куртку, шарф, рукавички та головний убір."
            "Намагайтеся обмежити тривале перебування на відкритому повітрі, особливо у вітряну погоду. При пересуванні по слизьких поверхнях будьте обережні - взуття повинно мати підошву, що не ковзає.\n"
            "<br><strong>Особливі поради: </strong>"
            "Людям із серцево-судинними захворюваннями важливо уникати різких перепадів температур і не переохолоджуватися. "
            "Людям похилого віку, дітям і вагітним - обов'язково стежити за тепловим комфортом, особливо в ранкові години. "
            "Людям з хронічними захворюваннями суглобів або дихальної системи слід уникати тривалих прогулянок та переохолодження."
        )
    else:
        recommendation = (
            "На вулиці сильний холод. Необхідно одягатися максимально тепло: термобілизна, багатошаровий одяг, утеплена куртка, шапка, шарф, рукавички та зимове взуття з ковзною підошвою. "
            "Відкриті ділянки шкіри рекомендується захищати від обмороження, особливо при сильному вітрі. "
            "Намагайтеся скоротити час перебування на вулиці до мінімуму, особливо в ранкові та вечірні години. "
            "Перед виходом — перевірте прогноз на вітер і температуру, що відчувається, оскільки вона може бути значно нижчою від фактичної.\n "
            "<strong>Особливі поради: </strong><br>"
            "Людям із захворюваннями серця та судин, астмою, хронічним бронхітом, діабетом та порушенням кровообігу - слід уникати виходу з дому без крайньої необхідності. "
            "Людям похилого віку, дітям і вагітним - вкрай важливо забезпечити захист від переохолодження. "
            "Якщо з'явилося тремтіння, оніміння кінцівок або запаморочення - терміново поверніться в тепле приміщення."
        )
    # print(f"Generated recommendation: {recommendation}")
    return recommendation
